app/controllers/game_controller.rb

  def join
    debug = params[:debug]
    ai = params[:ai]
    game = Game.waiting.last()
    if !game || debug
      game = Game.new_with_game_board(ai || debug)
    end

    game.save!
    @player = Player.new(:name => params[:name])
    @player.setup(game.game_board.initial_tile)
    @player.save!

    game.add_player!(@player)
    game.start_game if game.ready?
    game.save!
---
SELECT "games".* FROM "games" WHERE (player1_id IS NULL OR player2_id IS NULL) ORDER BY games.id DESC LIMIT 1
INSERT INTO "game_boards" ("y", "x", "game_id", "updated_at", "created_at") VALUES (21, 21, NULL, '2010-12-29 02:28:31.307118', '2010-12-29 02:28:31.307118')
INSERT INTO "games" ("updated_at", "player2_id", "player1_id", "game_board_id", "created_at") VALUES ('2010-12-28 00:52:28.868489', NULL, NULL, NULL, '2010-12-28 00:52:28.868489')
UPDATE "game_boards" SET "updated_at" = '2010-12-29 02:27:29.677593', "game_id" = 17 WHERE ("game_boards"."id" = 17)
UPDATE "games" SET "updated_at" = '2010-12-27 20:03:38.719275', "player2_id" = 3 WHERE ("games"."id" = 3)
INSERT INTO "players" ("chocolate", "money", "created_at", "prev_y", "prev_x", "can_move", "turn", "sales", "x", "game_id", "vanilla", "turns_remaining", "uuid", "can_act", "y", "kills", "strawberry", "updated_at") VALUES (5, 5.0, '2010-12-22 20:26:25.338855', NULL, NULL, NULL, NULL, 0, 37, NULL, 5, 20, 'EKTFIBVTKDEKTMDM', NULL, 37, 0, 5, '2010-12-22 20:26:25.338855')
INSERT INTO "tiles" ("zombies", "y", "x", "game_board_id", "store", "updated_at", "created_at") VALUES (0, 15, 15, NULL, 't', '2010-12-27 20:16:32.662169', '2010-12-27 20:16:32.662169')
UPDATE "players" SET "updated_at" = '2010-12-29 03:01:35.686618', "can_act" = 'f', "turns_remaining" = 19, "kills" = 1 WHERE ("players"."id" = 56)
UPDATE "tiles" SET "updated_at" = '2010-12-22 20:28:48.988558', "game_board_id" = 1 WHERE ("tiles"."id" = 1)

  def get_turn
    @player = Player.find_by_uuid(params[:uuid])
---
SELECT "players".* FROM "players" WHERE ("players"."uuid" = 'EKTFIBVTKDEKTMDM') LIMIT 1

  def get_game_state
    @player = Player.find_by_uuid(params[:uuid])
---
SELECT "players".* FROM "players" WHERE ("players"."uuid" = 'CYBTNILPJWCDLWTV') LIMIT 1

  def post_make_move
    #moves to a new tile : if tile doesn't exist, create the tile and add it to the game_state
    @player = Player.find_by_uuid(params[:uuid])
---
SELECT "players".* FROM "players" WHERE ("players"."uuid" = 'HABTHHCVNRUNWRTA') LIMIT 1